articles/OE-NK.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>OE And NK</title>
<!-- 2015-12-28 Mon 11:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="冰糖火箭筒(Junjia Ni)" />
<meta  name="description" content="静态博客预览编辑发布工具"
 />
<meta  name="keywords" content="emacs,orgmode,静态博客,blog,static-blog" />
<link rel="stylesheet" type="text/css" href="/static/style.css"><link rel="stylesheet" type="text/css" href="/static/medium-fonts.css">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="http://creamidea.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">OE And NK</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 前奏</a></li>
<li><a href="#sec-2">2. 设计要素</a></li>
<li><a href="#sec-3">3. 初始化操作</a>
<ul>
<li><a href="#sec-3-1">3.1. 两个库（两个分支）</a></li>
<li><a href="#sec-3-2">3.2. articles</a></li>
<li><a href="#sec-3-3">3.3. public</a></li>
</ul>
</li>
<li><a href="#sec-4">4. 发布</a></li>
<li><a href="#sec-5">5. 尾声</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 前奏</h2>
<div class="outline-text-2" id="text-1">
<p>
最近闲着无聊，感觉也没有什么特别的事情要干，于是又回到了整博客上了。
一开始的时候，也没有想要做成什么样子，只是自己写写字的地方。用orgmode来写文章，写好之后导出。
加一点点js和css让其变得好看一点。就是这么简单。
</p>

<p>
但是后来发现，需要维护2个库（一个是文章的库，另一个是导出的库），提交成本有点高，于是想写一个shell脚本，简单处理一下即可。
不过，写好之后测试发现，是同步提交的。这就意味着，必须提交完成之后才能进行下一个。
这个可是忍不了的，虽然解决了之前手动敲2遍命令的麻烦，可是依然很耗时。尤其是在 <b>大天朝</b> 。
</p>

<p>
没有办法，只能使用更加高级的脚本来解决。最初的想法是想用 <b>Python</b> 来搞定的，但是发现自己大部分Python语法已然忘记。
自己现在会的只有一点点JavaScript，哈哈哈，大笑3声之后，用起了node。一开始的时候，只是简单的一个js脚本，创建2个线程，写好测试成功。
心里很是满意。
</p>

<p>
没过一分钟，突然想到预览的时候使用的是一行Python命令 <code>python -m SimpleHTTPServer 8080</code> 来起的服务器。何不将这个合并到之前脚本中去呢？
</p>

<p>
于是&#x2026;.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 设计要素</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>OEAndNK</b> 用来预览发布orgmode导出的文章。她不解决git冲突，不做任何和预览发布不相关的事情（暂时）。
</p>

<p>
依赖orgmode导出的原始HTML文件，关于orgmode如何配置，可以看我这篇文章 <a href="./This-Site.html#sec-2-3">This-Site.org#orgmode</a> 中关于orgmode那部分的内容。
导出配置中带有外部js和css链接，这个就是全部美化的核心了。
</p>

<p>
在node部分，使用了 <a href="http://koajs.com/">koa</a> 框架做HTTP协议处理、页面的渲染等工作，监听3000端口。使用 <a href="https://tools.ietf.org/html/rfc6455">websocket</a> 协议用于前台和服务器信息交流的桥梁，监听3001端口。
上面就是我的思路了，实现上面其实不是很美好，所以就不宣传了，如果想参考一下，可以点击 <a href="https://github.com/creamidea/oe-nk">这里</a> 。
</p>

<p>
接下来想怎么玩就怎么玩啦。
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 初始化操作</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 两个库（两个分支）</h3>
<div class="outline-text-3" id="text-3-1">
<p>
这里你可以是两个库，也可以是两个分支。我的话是搞成了两个库。
一个库(creamidea)用于放原始文章，另一个库(creamidea.github.com)用于放导出的文章，也就是最终效果页面的库。
</p>
<div class="org-src-container">

<pre class="src src-js"><span style="color: #859900;">var</span> <span style="color: #268bd2;">child1</span> = child_process.fork(__dirname + <span style="color: #2aa198;">'/deploy.js'</span>, [<span style="color: #2aa198;">'articles'</span>, <span style="color: #2aa198;">'.'</span>, message.argv[0]])
<span style="color: #859900;">var</span> <span style="color: #268bd2;">child2</span> = child_process.fork(__dirname + <span style="color: #2aa198;">'/deploy.js'</span>, [<span style="color: #2aa198;">'master'</span>, <span style="color: #2aa198;">'.'</span>, message.argv[0]])
</pre>
</div>
<ul class="org-ul">
<li>artilces  用来放文章的地方，原始的org文件
</li>
<li>public 导出的文章，包括js/css，这个分支同步到你的 <b>nickname</b>.github.io
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> articles</h3>
<div class="outline-text-3" id="text-3-2">
<p>
文章库的初始化，将文章库的位置赋值给 <b>deploy.js</b> 中的 <code>articlesDir</code> 。
然后增加远程库地址并设置&#x2013;set-upstream:
</p>
<div class="org-src-container">

<pre class="src src-sh">$ git remote add origin git@github.com:your-repo-path
$ git branch --set-upstream my_branch origin/my_branch
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> public</h3>
<div class="outline-text-3" id="text-3-3">
<p>
文章公共库，用于Github Page引擎渲染的库，赋值 <b>deploy.js</b> 中的 <code>publicDir</code> 。
然后增加远程库地址并设置&#x2013;set-upstream:
</p>
<div class="org-src-container">

<pre class="src src-sh">$ git remote add origin git@github.com:your-page-repo-path
$ git branch --set-upstream my_branch origin/my_branch
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 发布</h2>
<div class="outline-text-2" id="text-4">
<p>
初始化动作都完成之后，以后的步骤就非常的简单了，只要点击一次 <b>Publish</b> 按钮就可以了。
这颗按钮只会在线下有，线上是没有的。
</p>

<p>
那怎么实现的呢？
</p>

<p>
其实很简单，就是本地起的服务器中，在传到浏览器的流中植入了本地的一些js，来动态处理这些。
</p>
<div class="org-src-container">

<pre class="src src-js">app.use(<span style="color: #859900;">function</span>*(next) {
  <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">console.log(this)</span>
  <span style="color: #859900;">yield</span> next

  <span style="color: #859900;">var</span> <span style="color: #268bd2;">body</span> = <span style="color: #2aa198;">this</span>.body
  <span style="color: #859900;">var</span> <span style="color: #268bd2;">type</span> = <span style="color: #2aa198;">this</span>.type
  <span style="color: #859900;">if</span> (type === <span style="color: #2aa198;">'html'</span> || type === <span style="color: #2aa198;">'text/html'</span>) {
    <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">&#25130;&#33719;koa-static&#22788;&#29702;&#30340;html&#25991;&#20214;&#65292;&#25554;&#20837;&#33258;&#24049;&#24819;&#35201;&#30340;&#19996;&#35199;&#65292;&#28982;&#21518;&#36820;&#22238;</span>
    <span style="color: #859900;">var</span> <span style="color: #268bd2;">html</span> = <span style="color: #2aa198;">""</span>
    body.on(<span style="color: #2aa198;">'data'</span>, <span style="color: #859900;">function</span>(<span style="color: #268bd2;">chunk</span>) {
      <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">console.log(chunk.toString());</span>
      html = chunk.toString()
      html = html.slice(0, -16) +
        <span style="color: #2aa198;">'&lt;div id="oe-nk-local"&gt;&lt;/div&gt;'</span> +
        <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">'&lt;link rel="stylesheet" type="text/css" href="publish.css"&gt;'+</span>
        <span style="color: #2aa198;">'&lt;script src="/bower_components/react/react.min.js"&gt;&lt;/script&gt;'</span> +
        <span style="color: #2aa198;">'&lt;script src="/bower_components/react/react-with-addons.min.js"&gt;&lt;/script&gt;'</span> +
        <span style="color: #2aa198;">'&lt;script src="/bower_components/react/react-dom.min.js"&gt;&lt;/script&gt;'</span> +
        <span style="color: #2aa198;">'&lt;script src="/bower_components/ace/build/src-min-noconflict/ace.js"&gt;&lt;/script&gt;'</span> +
        <span style="color: #2aa198;">'&lt;script src="/bundle.js"&gt;&lt;/script&gt;'</span> +
        <span style="color: #2aa198;">'&lt;/body&gt;&lt;/html&gt;'</span>
    })
    <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">yield body.on('end')</span>
    <span style="color: #859900;">yield</span> body.on.bind(body, <span style="color: #2aa198;">'end'</span>) <span style="color: #93a1a1; font-style: italic;">// </span><span style="color: #93a1a1; font-style: italic;">TODO: &#29702;&#35299;&#36825;&#37324;&#30340;&#24847;&#24605; http://stackoverflow.com/a/23853606/1925954</span>
    <span style="color: #2aa198;">this</span>.body = html
  }
})
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 尾声</h2>
<div class="outline-text-2" id="text-5">
<p>
完成上述一些环境搭建，初始化步骤之后，以后写完检查无误就可以点击按钮发布了。如丝般顺滑。
</p>

<p>
但是，我后来做着做着就想增加更多的功能了，比如：
</p>
<ul class="org-ul">
<li>优化前端 <b>TERMINAL</b> 信息展示
</li>
<li>增加在线编辑的功能
</li>
<li>提取文章关键字
</li>
<li>搜索
</li>
<li>……
</li>
</ul>

<p>
前两个功能可以使用 <a href="https://github.com/creamidea/ace">ace editor</a> 这个库自定义来实现，后面的可能需要更多自然语言方面的知识。然而，这些，我现在都不会。
如果谁感兴趣的话，可以玩玩。我也只有等以后有空，挤点时间慢慢来完成这些功能了。又是一个大坑。
</p>

<p>
以上。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="meta-article"><p class="author">冰糖火箭筒(Junjia Ni)</p>
<p class="email"><a href="mailto:creamidea@gmail.com">creamidea@gmail.com</a></p>
<p class="date">2015-12-27</p>
<p class="export-date">2015-12-28 Mon 11:41</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
<p class="last-modification-time">2015-12-27 Sun 13:46</p></div><script src="/static/app.js"></script><!-- Google Analytics --><script>window.ga=window.ga||function(){(ga.q=ga.q||[]).push(arguments)};ga.l=+new Date;ga('create', 'UA-38213594-1', 'auto');ga('send', 'pageview');</script><script async src='//www.google-analytics.com/analytics.js'></script><!-- End Google Analytics -->
</div>
</body>
</html>
